---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarHookAngle
source: html/34e1398b-c7d2-dd2c-6a9b-df46072bd00a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarHookAngle Property

"Hook Angle"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarHookAngle { get; }
```